app/views/poll/show.html.erb

SELECT "choices".* FROM "choices" WHERE "choices"."poll_id" = ?  [["poll_id", 34]]
---

	<% @poll.choices.each do |choice|%>